Repository: rrd108/moto-simple
Catalog: payments/gateways/simplepay/simplepay-*.po
Languages: hu

source: Pay via Simplepay
hu: Fizess Simplepay-jel

source: Redirecting to SimplePay
hu: Átirányítás a SimplePay-re

source: Pay by credit card
hu: Fizess bankkártyával

source: Booking amount
hu: Foglalási összeg

source: Go to SimplePay
hu: Irány a SimplePay

source: SimplePay transaction ID is
hu: A SimplePay tranzakció azonosító

source: Your booking ID is
hu: Foglalási azonosító

source: Transaction date is
hu: Tranzakció dátuma

source: You have cancelled the payment
hu: Megszakítottad a fizetést

source: You exceeded the maximum time available to start the transaction.
hu: A tranzakció maximális időtartama lejárt.

source: Please check if the details provided during the transaction are correct.
hu: Kélek ellenőrizd, hogy a tranzakció során megadott adatok helyesek-e.

source: If all of the details were provided correctly, please contact the bank that issued your card in order to investigate the cause of the rejection.
hu: Ha az azonosító adatokat helyesen adtad meg, akkor keresd meg a kártyakibocsátó bankodat, hogy megtudd a kártyád miért került elutasításra.
